package test;
/**
* @author DaydreaminE
* @version 创建时间：2020年3月12日 下午4:24:26
* 类说明
*/
public class test {

}
/*

1、编译Java Application 源程序文件将产生相应的字节码文件，这些字节码文件的扩展名为( B. .class )。
2、设 x = 1 , y = 2 , z = 3，则表达式 y＋＝z－－/＋＋x 的值是(     A. 3     )。
3、不允许作为类及类成员的访问控制符的是(C. static).
4、为AB类的一个无形式参数无返回值的方法method书写方法头，使得使用类名AB作为前缀就可以调用它，该方法头的形式为( A. static void method( ) )。
5、给定java 代码如下，编译运行后，输出结果是( c) 2 )(选择一项）。 
6．设有定义语句“int a[]={66,88,99};”，则以下对此语句的叙述错误的是（C．a数组的元素的下标为1～3   ）
7．设有定义“int[] a=new int[4];”则数组a的所有元素是（B．a[0]、a[1]、a[2]、a[3] ）
8．下面哪个选项正确地声明了一个字符串数组 （C．String[] str ）
9、假设有这样的数组创建：int a[]={1,2,3,4,5,6,7};则该数组长度为 (D．7 )。
10、下列二维数组的创建中错误的是(D．int [][] a=new int[][]; )。
11 方法内定义的变量（A．一定在方法内所有位置可见 ）。
12 方法的形参（A．可以没有）。
13 return语句（A．不能用来返回对象）。
14．main()方法的返回值类型是( B．int)
15．编译并运行下面的程序，运行结果是（A．程序可以编译运行，输出结果为：“int:  8” ）。
16．能作为类及其成员的修饰符是（B．class ）。
17．下列方法定义中，方法头不正确的是（A．public static x(double a){…}).
18．构造方法在（D．创建对象时 ）时被调用。
19．下列哪个类声明是正确的（ A．public abstract class Car{…}）。
20．下列不属于面向对象程序设计的基本特征的是（D．静态）。
21．请看下面的程序  A．Person(n,a)
22.方法fun()如何来访问变量m（ C．将private int m 改成static int m  ）
24.有一个类A，对于其构造函数的声明正确的是（B．public A(int x){…}).
25.哪一个选项是正确的（ B．输出0  ）。
26关键字（B．final）表明一个对象或变量在初始化后不能修改。
27．声明为static的方法不能访问（A．超类 ）类成员。
28.下面对方法B的重载哪个是正确的（ C．public void B(int x,int y){ a=x;b=y;c=0;}     ）。
29．编译运行下面的程序，结果是（ ）。










*/